[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
3750
648
900
3370
6122
4464
7399
4939
3659
4811
5598
669
2465
2400
5560
299
2109
4893
4411
1699
1519
803
1635
6065
5998
1903
5445
1324
2376
340
4659
3800
1633
5948
1460
1985
6017
2614
1465
3961
5393
4853
2210
5602
6250
3700
5977
2799
4646
7539
4516
2252
7543
151
6357
619
3915
5410
913
7495
6093
5620
4128
5780
5915
4149
7194
3223
2073
307
1375
2490
2662
5491
4490
5036
5296
4269
2106
5858
5330
3686
1394
1667
6045
465
3099
5430
5176
1866
2539
25
4559
192
6038
4704
1141
6248
1080
3272
5028
1567
6831
4190
6104
3618
3374
7010
2859
1702
3530
3166
2119
3605
6407
4525
4822
6644
1099
5659
3772
7186
5589
5510
531
6637
1407
5619
2986
4480
3641
4063
1920
1906
1722
2515
23
5677
910
5778
5689
5736
4124
5011
4167
1070
5310
1767
2212
7377
5612
7509
1018
2595
1736
6835
3263
3809
281
5537
1363
1277
3893
3220
3743
2555
2541
5566
4958
6887
1871
2289
742
2107
2265
3300
4969
5949
2597
6040
6242
4151
4409
5057
512
486
1066
3870
1854
5096
4562
2313
7058
7467
7261
2828
7492
62
5470
3747
7346
4109
5051
6508
2693
7239
2112
7044
3068
5702
5526
6832
3661
6810
4392
1731
7123
2489
2364
2380
1679
5264
3694
4211
6734
3859
6333
1734
6293
6929
6630
6980
4936
6759
6983
3560
6286
2729
1344
3568
1815
4576
1215
6656
1913
7305
1401
5530
7055
1031
4721
7444
2770
761
5520
4231
5284
2538
2304
150
3792
3634
2549
2461
6501
6641
1647
3630
6101
4630
2975
5037
2087
1877
5271
2967
7370
2471
1036
3193
4498
4139
4230
2410
3038
4655
1859
3196
3706
2827
2621
5640
730
1362
4148
4301
3154
2197
6301
3433
4293
1779
1348
3000
3586
450
7039
1279
6289
3335
6453
606
6609
3864
3780
6770
6206
2147
544
5718
2446
1726
623
4068
2466
4967
5122
2058
4333
1334
6469
2923
7255
2717
1641
4216
6713
4261
2674
4350
6405
955
6714
4933
1264
5282
2456
6822
2810
5450
1271
3578
3523
5328
3440
2402
1816
4499
3317
4462
6920
7309
885
6811
2786
4412
433
290
5192
4671
6909
5681
2115
5538
7328
7160
7449
478
922
19
3692
2791
5724
1844
3397
3067
408
134
6485
3912
264
6654
5787
541
2444
7403
670
4599
6178
1241
5041
94
7349
2891
7212
3976
656
893
5338
4326
4180
3971
4046
868
6012
350
872
4902
4321
4181
133
3018
1610
4173
4089
1952
2192
4298
2151
2154
7159
2463
535
4417
6227
5139
4117
4233
6521
2685
4744
3607
6352
4407
2899
1511
2226
6666
2695
2435
671
7400
1605
5397
1582
5178
1219
3585
3242
4531
1580
4105
1258
5505
2974
6740
2282
7256
2042
5864
4125
790
4866
4923
6966
7486
1695
2522
3695
2477
6569
5165
4080
4612
5547
7154
6050
4981
6088
5955
6919
4998
296
4469
3329
5889
3504
5906
6861
5519
1571
116
2029
4650
965
383
2612
4510
5971
4430
1970
3461
6833
2021
4145
3137
3648
3765
3203
4568
265
826
4741
64
5006
5938
4355
1934
6518
4396
6846
2993
2396
3231
2121
5498
7363
5292
3373
2315
4166
7408
314
3901
3508
330
5698
343
2848
1660
6722
3106
6319
6143
4780
4291
847
6886
1457
5744
1146
2448
1999
6689
5497
532
248
2205
5708
2004
5099
736
1227
137
2506
6014
5235
3117
5810
2990
1323
3764
7037
5166
980
5999
4909
5788
5920
3770
6350
3056
1116
3464
920
7528
2970
3342
751
6535
7420
5816
4986
507
4653
3012
3500
3945
4802
1283
1592
7465
3007
5926
3824
794
663
1308
2688
1395
3937
3310
2334
6182
1919
6160
2255
414
6596
7047
3289
1706
88
7257
1335
4553
5988
5226
584
4381
565
419
7013
1613
810
5521
4351
3495
1778
5105
5370
4751
2984
4114
6798
517
4042
974
1043
6043
7354
6902
6854
5413
4819
600
827
4760
591
1951
5221
3019
7327
2499
1924
7006
1684
5909
4399
101
3366
6678
2851
6220
4237
4450
6768
1245
1405
6223
2592
764
6284
2738
3255
3731
7251
127
6985
7436
5803
6235
1724
3051
1351
2968
641
1688
4053
2348
5562
3644
4603
4369
2331
7023
3477
2007
2835
5814
1214
138
4315
3725
4583
5251
2716
3017
4677
5492
3646
3084
2570
220
1735
1315
1132
6930
4768
7366
2918
2378
3481
5063
5984
4302
3396
1899
2528
7134
144
3819
5081
6165
7127
983
5791
1152
6962
5179
211
5957
2218
1629
53
5688
6602
6751
2838
293
1697
3186
6163
4220
2983
6651
2769
3283
1255
304
5801
5693
4040
2316
6973
5839
5117
6176
6515
3134
3227
979
6977
462
4543
7077
3377
6567
2407
3097
936
6725
1379
7091
1170
543
1914
3247
1879
7532
3364
6308
6027
902
7421
3128
734
26
3956
6662
7042
5095
1103
569
56
3987
4036
4542
6015
6899
6695
1730
6760
4858
7373
4595
2230
3501
5881
6560
1889
3844
873
2367
6115
6003
316
6552
6007
2722
894
3529
5389
7147
2328
7490
4202
495
4786
812
2131
2602
6583
5854
2229
6314
5775
3129
5860
4287
3531
7019
6613
4458
2505
4779
404
3938
499
1805
4454
38
4329
4340
4558
3654
5511
3775
442
5997
578
3032
6908
69
4372
5603
197
5005
6482
1247
1327
5660
5288
1991
431
1061
6663
7032
3130
1292
7292
5623
7344
4648
1299
7326
1388
5466
4377
2318
4021
7206
1623
3598
2076
5168
2283
3613
1252
212
3665
5882
3615
5617
7125
1168
4163
6167
5396
245
2099
2399
6968
368
4636
3198
3860
2211
7330
6972
6639
3949
6615
5741
1267
6729
5486
4223
7219
5243
3270
5239
6588
3691
1757
4403
4547
886
3299
2708
1939
1590
3456
2699
1693
6362
2935
4921
6940
4130
3090
3873
5298
2683
1960
5381
1622
4205
5385
3120
6549
443
5436
83
6004
6543
6047
948
36
3107
3469
2397
4183
4354
6631
4876
7507
3515
5335
869
3608
7458
5495
3015
7445
3762
318
3226
2491
4679
7395
3771
5604
1205
7371
6551
1154
657
5573
1891
2023
5883
3994
1946
57
1232
2741
5395
7078
2873
930
4003
1987
1616
4305
6986
2776
1819
3782
1250
1274
3606
1148
4643
659
1846
2434
2642
355
219
5367
7029
6875
4842
7157
677
7025
141
5305
5422
6674
957
1793
1936
2484
7180
2495
5480
1670
3418
5594
4544
3484
2181
3070
6193
5606
5089
4203
5678
6192
4894
1953
1715
6890
7121
7250
5936
6066
4120
2663
6758
6390
6888
652
6587
3148
3066
6649
6063
7254
3577
1129
7117
729
7393
4413
7533
2847
4641
4118
5194
361
1006
3088
1370
7059
6149
2502
5822
4214
5658
3021
2745
4587
5482
580
5935
632
1814
3155
3442
29
1397
7033
1121
2060
5731
3783
349
3811
3040
2727
2145
6393
6671
3436
781
3062
2919
6959
4378
1972
4691
1746
463
78
932
2795
6221
7329
583
6046
3466
7546
5647
4491
763
3213
6905
5821
470
1361
6417
5109
6917
1518
6625
2124
5278
7311
7419
3151
5169
5649
5493
4270
5484
2766
2512
2012
3172
6243
993
2594
6444
5472
6881
3744
1698
1110
3055
445
3104
4486
216
2655
3159
5229
2221
3479
7038
1078
3703
1750
1782
2080
1743
1386
2411
7137
177
2196
5610
5574
405
1500
4628
5426
6704
5705
4199
5535
341
3400
382
3720
2130
5203
5631
1569
5555
5322
5402
1302
2936
3039
5202
7110
4122
2035
6898
2610
3354
2028
7447
3168
2646
6981
1744
3112
100
6296
6079
3943
2164
2576
5695
3482
4065
2024
1865
2524
2730
45
43
5525
7045
3257
6542
2393
3506
252
6356
3215
1907
5134
7075
1941
686
796
1081
5950
4993
4778
4683
180
6447
6748
1963
2091
4941
811
1618
4482
4829
2421
6788
415
1915
4626
1956
5663
3126
3813
628
6325
5600
3189
3766
1294
7544
6127
5121
1206
4987
5648
768
5986
2511
6862
3651
4832
2910
3312
5870
4693
6236
2768
6682
903
317
7129
1390
2429
13
5964
292
6037
4784
5333
518
6078
3080
7192
1425
84
2415
5502
3030
998
1545
5380
4289
5872
832
750
5085
5277
6298
6389
6992
2279
5728
1389
5739
2267
6894
5295
4005
1100
7387
1829
6111
1732
1566
4861
5536
4974
1995
4590
2423
5064
5289
2354
5160
7378
5056
4225
2749
2437
4218
5683
2931
1459
7122
505
1853
851
5190
366
1515
157
6965
7360
7451
4848
6864
1833
889
3955
6493
2120
4851
7144
5374
5847
1516
654
5850
3103
5474
5644
1014
239
3650
5770
4017
2879
848
4123
5416
3705
2480
571
2626
4976
3438
4030
3318
2198
1270
7152
7541
3793
7106
6658
6994
5799
5369
634
182
2842
6324
6203
2329
5234
5716
2274
4505
18
3836
1160
2022
7548
5513
6571
3324
1508
3285
6139
1151
6414
1777
5613
3512
2370
2771
225
5153
3681
938
5504
2046
3724
7527
4686
5469
3049
1211
566
6600
4260
7295
4106
1542
2346
3182
3073
3268
1839
4592
1721
4245
339
6346
3966
2525
6398
1242
2483
58
420
456
5217
384
3878
4781
2049
1775
3711
4144
5899
3343
208
5968
6375
6265
5208
3563
2234
5076
4988
515
457
7477
1620
3209
856
2866
879
2030
6683
7394
986
1965
760
2841
2656
2248
6164
4917
3170
2047
4448
2603
667
4699
7028
6906
1885
3053
7051
1640
7317
4324
5399
4375
5184
5488
3248
1166
6441
1883
5777
7213
6360
660
1158
4874
2976
1835
6119
4836
3533
1057
2214
6175
4878
2127
4150
5694
6445
4906
5651
2785
1291
3503
2275
7383
676
4002
3407
482
5254
1402
2519
1087
4597
5026
908
4429
4108
2473
2564
5621
1304
4022
2474
3818
4743
4927
3319
7475
3749
1832
1758
1176
4188
3004
2070
2998
4334
5804
6283
5361
3472
2068
459
2379
5793
5281
6327
7362
6511
3309
6133
5144
7148
3627
394
4971
2667
4061
489
3238
2327
5411
3414
3978
7513
5459
2908
2273
3784
4257
6011
788
1588
4718
2647
3362
4335
4662
6889
2702
4758
2369
6956
6311
2487
4700
440
3583
554
7008
4018
7088
1480
3988
4337
2728
6272
1022
3430
3111
5242
6158
4278
5257
4928
6267
426
227
5514
513
1855
3444
853
672
4801
2556
5297
1265
3689
4274
3359
4436
5917
1174
7062
7000
1060
2620
2867
5033
7069
6575
2563
4097
3620
6996
7479
4475
740
2762
4386
1360
4794
802
777
5477
347
247
5347
3576
6141
2709
2942
4680
5316
791
6490
6287
6396
6574
4567
2638
3718
5004
1452
5542
2732
4934
2862
5811
1977
2648
1111
5348
6161
6640
5918
5052
5785
3717
4152
6817
4176
6252
5624
7238
5886
4719
3740
7164
7111
496
7417
7175
5468
4831
2439
2233
4249
1325
778
2820
4841
2406
5922
14
4478
3110
3489
1657
758
2272
1289
5247
6402
4871
4657
4750
2420
3842
572
3360
945
5834
895
2979
3212
1320
1343
1818
1827
5125
5931
7520
6474
1603
5591
1268
519
1076
1514
5501
498
3158
3349
6454
4536
2458
3742
2453
1638
6680
2639
1471
1656
2586
5684
2988
194
60
4709
7234
4968
1428
4070
485
1737
6825
5034
6234
5368
5391
550
4153
3351
5269
5406
238
2686
5638
6318
4366
6802
6337
1122
2428
4119
1220
4732
1350
5641
646
7224
7462
1696
6818
2680
2582
536
2756
1858
3173
244
6895
5017
1764
6738
1964
2558
2818
6681
2188
3899
6976
5308
4775
5306
581
6427
1564
1565
2479
6780
4431
2772
3420
1008
1352
2382
226
6054
6754
2425
6512
2019
3181
7375
5136
4908
645
2644
4007
4402
5746
4276
6946
4083
1981
951
5753
4052
1917
3059
1504
4835
203
5047
6819
5581
2185
136
4970
6610
4374
4280
3921
746
6380
5189
2330
5709
4191
697
4930
2290
6000
2682
4285
3545
6391
3851
1112
4157
6431
1287
3982
3745
1973
4675
5438
1474
3125
6144
5823
4728
3036
3344
1107
2169
978
7510
5383
3005
6211
3886
2179
2914
3336
7016
4960
5928
1986
1783
3095
7109
2247
816
2567
6087
1587
2987
1760
4515
4232
631
3781
4479
523
455
4736
562
2431
4707
1096
5773
5087
1396
3425
1184
1090
1604
3267
3727
5686
4929
7210
4077
6947
4466
3580
2350
1550
6916
5961
5824
8
5592
2740
5656
289
3821
4717
6897
2999
5776
3290
3161
4460
5213
7241
167
5972
699
1314
4560
176
4439
1419
4275
2591
6471
6922
7017
3845
6423
561
1391
7207
5000
2514
7196
4690
2055
490
5206
6928
3517
327
5815
1536
2673
843
3657
7043
3679
5691
3147
2363
4951
3152
2526
7454
3795
6171
3150
6355
3093
5862
3626
4267
5884
1842
2017
4313
5420
926
5532
4082
2863
2540
3338
4989
2508
5572
3544
5371
452
4782
1050
2005
3934
2831
4922
4762
1266
1243
6781
7540
1497
1127
785
7156
970
7097
5979
1073
3002
6800
7265
1606
2893
6635
5344
5929
1950
1373
6016
1678
5423
268
2011
6892
7335
5969
4357
2438
7525
2566
2190
5868
2724
5127
5475
2266
5960
1142
6387
1424
1195
4729
2202
3923
1435
4627
6507
6855
6842
6565
54
1690
4796
2530
2366
7512
3326
560
1888
6295
5769
3435
4265
6256
732
981
5233
35
5954
4745
7452
4461
1719
1540
4582
1295
2572
5214
6134
4194
6720
1002
152
5618
3167
4912
4767
6057
5200
4695
2209
2804
4006
3455
7496
7483
752
3253
5118
3643
5907
3266
6504
399
715
795
5937
6108
4169
5182
4761
7222
4614
438
4034
430
1755
159
6500
4512
4310
6036
5720
1791
3778
5529
4090
4493
3992
881
338
743
6436
6750
3914
3327
5360
1718
5900
1892
2293
5215
195
6487
1780
3207
7339
6694
592
4814
1510
3554
2995
5552
642
3020
1047
1092
1902
3079
6430
218
4442
6730
3403
6055
7426
2857
2144
1453
5050
418
1013
6799
711
3614
1431
1440
3232
4748
3603
4757
7183
7391
3905
3200
1631
6829
7353
1741
6608
4985
5273
6472
4356
6562
6838
5956
4476
878
326
1619
3868
1940
7169
817
178
4255
2876
3177
4380
2103
4873
3729
5869
7245
2734
17
7380
1200
4066
1671
4506
6764
6621
5940
5518
228
6197
6971
2351
5571
3494
300
6796
3528
859
7150
3951
1905
4444
1124
7493
6510
2136
234
2691
2852
950
5020
5715
5212
2761
4991
1260
757
2260
5467
3113
253
1556
5792
3952
739
2710
1042
6513
7225
4405
1651
89
611
789
7208
1745
2341
240
1502
1916
1023
4500
156
7197
3850
6582
6303
4323
1065
3385
1071
119
214
7529
5274
3983
1164
1086
6702
3716
3647
413
6032
3649
128
2714
6870
1297
5156
5690
555
2240
4504
2924
3662
4004
6815
3910
6804
4358
1868
3280
6690
2178
6517
5673
6347
1423
2138
7404
3977
3925
4742
3262
6189
4862
4408
4940
7300
3946
1221
7098
3345
332
2345
2468
5714
4887
5003
5258
7001
4611
4055
6830
2581
5636
1191
7226
962
4382
3856
2631
4556
2713
2139
1251
7015
5340
3371
3141
5632
6056
7299
4651
3918
7272
1273
6914
254
988
2140
4766
354
2394
4031
6675
4575
2832
2236
6254
5595
5255
266
2231
5398
7453
1769
4914
5635
5442
2172
4514
1332
337
1838
6467
3617
3054
4262
2056
3313
7410
3610
780
5548
2156
6198
839
2739
4234
230
7034
3052
3411
6364
6570
7131
6757
4777
1639
727
3855
891
3273
1326
4896
6989
320
830
5177
112
3897
5317
6893
4509
741
377
1609
367
7501
6812
1140
6059
1416
6784
6404
4973
6135
4731
733
4715
5315
3225
6335
5668
2422
4623
145
3096
22
6377
411
529
964
3848
2945
4555
6199
476
1691
2958
610
61
7170
3447
1364
2925
1105
5092
397
6067
3941
5723
122
4720
1627
428
5895
473
6386
5865
5894
7096
7464
5082
7116
6244
2562
469
4012
5325
3011
2064
425
5512
1278
1055
149
5970
4624
5379
2653
403
1306
4961
187
1449
1928
5974
3631
3121
1826
1547
4864
3998
1822
5861
4903
2054
805
2561
2069
956
6151
2307
3416
2359
3622
1072
2875
1645
3451
285
500
3146
3807
5829
315
5614
722
6277
724
2964
1163
3917
3306
5752
7505
2571
6941
959
6338
2044
4440
4615
3758
1579
373
5228
4548
7168
4949
7282
6845
1102
5205
7086
5429
7534
3233
1984
4716
2000
2401
5697
1538
2356
3294
5129
4497
4565
3969
7442
4353
162
854
3746
5813
3825
7350
372
7190
6379
7424
6473
336
6949
2874
1486
6450
4549
3320
4660
3721
939
1848
1347
5873
3406
533
5094
7310
7333
2972
823
1648
2598
76
2523
6718
3732
4652
574
7491
6329
2189
3022
6878
975
301
3866
6633
1598
4889
6094
3304
6591
7031
1068
2472
3999
360
2237
5
1831
5418
2950
7289
6062
6636
2629
3664
2457
2098
1235
1694
4410
5892
5392
4956
4911
5876
6769
6749
3057
4771
3676
2902
1341
698
449
5059
3459
1614
6424
5941
6083
235
3265
6257
720
6126
6266
946
395
3565
6807
3521
933
907
3986
6937
6307
4658
6262
577
6142
3929
3254
2228
621
297
5578
3728
5903
1958
7515
1171
949
4843
2288
6932
257
3194
2604
1733
5840
682
7012
1234
7368
3567
2798
6085
1676
1563
3668
3869
3108
6753
2391
5607
6611
3127
644
5433
679
1044
3536
2547
2358
2917
707
5133
1089
5456
3483
6292
2778
6790
5634
6660
103
5010
5540
2513
3829
1411
4557
5417
1248
6848
6762
1870
4950
3973
2132
3562
674
3653
5874
4799
3271
1959
804
960
2299
7185
7361
1849
4574
7440
6809
2809
3346
2141
1787
3144
5071
5963
5580
3083
2721
1509
7381
3894
1529
40
6771
1938
710
4096
713
579
1451
1544
6497
806
5762
4093
7214
1669
4872
1406
762
7411
1000
4852
2170
6840
2901
2636
3683
564
2447
2381
7423
1208
1727
2102
6684
6174
5137
1931
5596
6435
4172
2310
2027
181
2705
7422
4924
770
429
370
4258
3340
852
207
1728
3990
2337
6233
3595
850
1417
1901
7162
5287
1307
1489
1033
1710
302
6850
6852
4451
5901
2510
3670
6557
5887
7188
2765
5074
1716
6545
4273
1199
3328
6128
3572
2253
5123
3445
3109
5674
6697
7181
3131
1890
7306
6847
3628
3311
7469
2938
4578
1309
3
6868
7223
6020
5115
447
1792
2929
4299
5107
468
1179
1811
5362
6785
2284
6491
3258
7046
3871
688
604
1441
2814
7531
3518
4048
7202
3965
4763
2123
1339
1366
6522
3907
4996
3779
797
1650
5471
6882
175
5405
6506
3723
3216
7523
6924
3812
217
901
2930
7318
5093
958
2239
324
3023
728
2
1674
6214
3558
5719
5856
6113
3714
1878
2374
7216
4606
4295
4712
4722
5921
2781
2531
875
2419
586
6988
5210
417
4300
2892
2232
5106
5293
2249
1182
6
2478
896
753
5013
1298
6900
6921
125
4416
2067
1595
4776
3277
4517
2706
6348
2939
1966
1173
1045
81
67
5733
5382
5932
3415
1384
6116
835
5018
1643
5114
115
1682
6563
6181
622
2220
323
1275
7494
3160
2285
1661
2689
3334
6328
3900
174
1608
6237
2679
1532
1466
1157
4390
5751
5008
7446
927
110
3047
3975
4078
5149
1038
4870
4168
3754
2291
5256
3655
6279
2985
6866
2250
5951
2812
5001
3903
4640
3487
5533
551
4788
684
1010
7294
2640
3391
912
1482
386
283
4999
3960
5687
2787
6185
2652
7277
1212
6156
4676
7093
1172
2038
6091
1433
4992
98
6229
59
1082
4164
1812
3426
6782
1093
653
2911
3139
6661
1685
5601
479
4702
6023
3889
2504
6733
2278
6238
378
204
3427
5404
5546
6843
2937
5431
4175
6313
5848
7312
6460
250
483
72
2905
6231
2485
6191
5452
3698
1751
3499
5478
2166
7405
5097
4824
5337
887
5549
651
5311
6594
2703
4522
1874
7519
2194
4854
509
2669
2692
165
3667
3734
1272
1900
4916
1948
2045
1004
2956
1180
1546
1823
4730
2947
3443
5797
1599
4014
3542
4817
4155
2268
6455
1978
5261
2006
1128
2565
1753
6316
233
1525
5186
4584
709
6618
7285
6369
7535
3940
3153
5952
3526
1067
7094
5487
6958
4494
3046
7179
5088
5779
2752
5978
6857
2953
4696
7332
1458
6580
1921
1594
7084
3449
3462
3854
5650
4789
6099
693
1084
2339
1358
4437
2167
1041
164
5738
4239
7459
7498
1496
4059
3833
107
2113
6140
2944
5241
7061
5352
4419
2224
5754
3756
6147
3592
5461
3808
118
3325
1961
5758
5796
3814
700
1700
5517
5622
1414
106
952
5147
5476
5171
3570
7301
5527
4774
7074
7060
1481
4759
3251
3348
2965
2634
4304
5039
943
246
2796
3557
1522
7342
5947
5494
5637
5902
7345
7050
421
3006
2665
2117
7499
5152
6334
7514
7542
4
4790
1809
1856
213
3063
5575
4982
4263
4250
2395
681
3275
2390
3297
5556
1108
5120
5174
1923
731
2182
553
1398
5819
4812
2032
3003
2432
2105
1196
2389
3474
6406
3383
4015
530
2297
3571
1909
1864
6679
2008
7275
6153
3947
4619
4667
4110
295
605
7288
2321
4837
2254
4572
2616
7336
2057
95
4642
400
3044
2033
6805
7478
5885
1165
4856
286
1296
4954
3428
5019
4198
3805
2496
5608
5079
963
3408
7545
3722
4880
7149
5207
2227
3308
6304
6370
558
6896
502
4279
774
3596
635
5544
2529
620
1367
5545
3485
7215
6294
6408
4423
198
1378
6533
2641
3984
1028
385
2615
5032
6385
4420
5506
3376
3392
5113
5628
1383
5191
1840
838
7461
1478
4793
3797
6275
504
2455
5703
1555
3157
3368
7448
7243
7313
7163
4739
844
2946
5993
6787
7100
1056
2223
2963
1413
6219
6084
708
6372
2527
6939
5270
70
5366
6659
6264
3763
82
3535
4133
2940
6259
5223
6481
6400
5443
1615
4705
4821
2966
3967
158
5657
1186
4397
5054
3081
2559
4875
6463
1126
3234
6998
3696
5040
2036
4879
2864
841
2632
5563
1880
7412
1256
1485
4178
4428
7537
2834
2507
3882
2596
831
4088
6031
1225
2915
6462
5995
2583
2163
6107
4035
3190
6026
74
7067
3822
3776
2039
510
5783
7500
2811
1749
5197
1461
612
3957
5286
1662
3087
1720
5939
4897
2780
4342
7120
6002
5387
4297
643
1467
2440
5851
6475
1664
5263
3785
5825
5183
1630
5781
3058
1083
2550
1353
5696
2637
2168
779
5835
3767
3249
4978
3733
7142
4957
4749
1794
4545
4131
260
2897
2149
1861
2336
2996
345
185
1517
1573
755
1442
2951
5128
7303
6786
4051
1725
4221
24
6064
5567
104
6345
4638
745
1993
1976
2535
6483
4081
453
407
7101
4580
1175
3496
5111
6100
2855
79
168
3534
4975
4596
424
16
2659
7365
6874
2922
7286
2079
6539
4094
7118
1752
1828
3184
7177
4844
5625
6150
7191
2800
4907
3931
540
4966
6821
7364
1908
4963
2065
2470
525
6960
7414
6712
4885
783
4826
545
4521
2623
3625
2894
6696
5732
1543
2973
171
3217
3315
4395
6954
7171
7036
4834
557
4944
4266
6546
714
4534
4995
2613
6531
7409
2912
191
5162
691
590
602
7227
6828
3419
3769
6232
1882
863
3393
2043
1873
4513
673
3179
1761
5048
2575
5669
944
4050
6667
7066
3959
6365
782
277
5990
169
4103
6392
1763
6616
3804
1188
3753
2129
4363
916
6544
6162
2751
6418
6918
3710
7203
358
99
5890
1686
6358
75
1040
232
4171
2503
4215
6013
6974
5193
4327
5962
3132
4529
2707
4797
3208
6556
416
1742
5259
7236
2162
994
2081
1432
5942
3933
2606
2672
4895
3219
918
7103
3412
5131
6103
3708
5376
570
6001
1409
1475
2718
5424
2775
1005
7176
615
2978
6239
1576
539
7304
1007
2332
6439
2089
7530
3115
3086
5652
3936
1974
3827
143
6622
3048
1032
3379
261
2568
2146
2460
2100
501
2241
2599
4809
2830
2449
4314
2789
4487
2096
6429
2110
2320
2187
690
1285
1570
7187
3286
5898
5415
4689
6727
5457
4467
7184
1426
6039
5349
1410
3025
1652
940
2025
6534
582
6326
6486
124
1559
3735
5421
5761
3541
6527
2880
2347
1189
599
4492
5195
222
52
1666
4581
5444
123
6130
1030
3911
4538
3246
4639
2955
2607
6188
5855
7470
5981
4137
196
448
3034
5944
6614
6646
3061
1201
6129
3243
7473
5246
6632
6883
3806
5727
1801
5407
864
1236
695
6595
6058
5067
3974
7115
5262
2155
267
48
1246
5151
7266
4079
1281
967
4663
4882
4935
3922
288
6502
4827
5561
1492
5388
3611
7248
3323
4177
2413
2003
5772
1713
369
5353
6415
4918
6190
4008
2793
3857
6166
4610
3078
6686
2219
4424
793
1672
2257
2992
7124
744
1910
5409
3045
6155
209
2546
637
3826
6584
1575
4681
5653
6744
6323
4507
5154
6019
5341
5086
3218
3347
4530
5806
5713
3876
3178
6564
3561
4850
2426
7369
799
3413
7341
5818
6033
3604
1336
3788
6110
4206
6090
3331
2152
6834
1400
1328
3375
1935
6499
6112
6420
344
3457
492
4000
3847
3801
7014
4752
2492
3071
4243
1847
7441
3537
4919
6359
1456
1954
6200
4433
4254
6255
1625
6035
6664
6461
5237
7228
5933
93
5959
6488
6041
548
1162
5774
2980
3492
3522
888
6528
1768
2664
1887
117
5812
837
6858
7389
1436
202
2731
5667
6477
5692
3369
6096
1149
4649
1527
303
432
5155
4288
2486
3538
898
2398
6249
3669
3693
3468
3964
7151
5685
4528
4189
5679
1387
2404
503
5249
6950
472
5304
5924
7536
3794
2225
3042
1988
821
6218
4607
6955
4449
1860
4984
4364
2200
3192
2957
4625
5808
3581
7517
2160
5022
1843
2587
617
1943
4060
4062
6434
312
3010
2026
2927
3228
3075
4654
4694
5605
704
2657
4604
1178
2195
6957
1046
4942
6154
6247
2309
1404
461
7334
5551
4383
4185
1533
3591
2712
2774
3493
924
7356
139
534
5807
4635
3602
4477
2943
6388
4926
7406
2670
1677
6904
2352
1382
5201
678
5857
5102
2063
5108
858
5666
7252
1305
3388
6820
6576
7182
2243
5905
6526
2806
4376
7049
4937
2649
917
1377
3707
4368
3065
3549
4422
996
7189
5541
1365
193
6931
1088
2758
2078
6371
2878
6102
2819
1925
7048
911
7258
6204
5615
1654
4343
5717
3547
4953
1632
7114
6195
32
1796
6877
3954
528
2933
7274
588
6739
6428
4341
4901
6240
953
3573
7200
3507
4229
6912
4979
42
435
7141
6022
4159
6049
3624
6726
647
941
976
4041
201
1254
5266
3041
6331
2183
6708
3924
2031
1216
1109
2794
4997
4311
10
1499
5680
2408
20
3566
1658
3454
4165
6121
4585
4898
6263
2601
4539
3791
4618
1557
1313
845
5609
357
7229
4348
987
4074
1059
1810
765
6867
6741
5219
1290
1817
1802
5836
721
7398
1601
3551
4714
3757
3016
4550
7244
1636
4026
573
305
2114
4569
7432
2840
5225
4196
5163
1159
1740
1230
4983
1537
1037
7135
5584
5927
3136
4904
1493
146
3237
4016
6746
627
3838
1190
1872
3736
7235
5664
1634
2083
1642
4134
389
2701
4783
706
7508
5276
4033
6194
6401
359
607
1097
4142
2521
34
3240
3550
7140
3239
1851
862
5016
1177
921
5805
4533
6529
1541
3206
1357
5967
2409
7516
4865
393
6520
2590
5272
147
6341
6624
2697
4349
2261
1637
6225
6590
1857
2443
5994
4962
4723
4025
5481
2134
3680
6601
4312
6440
4174
6880
4401
5786
4186
1572
7138
5725
3188
1130
7230
346
3140
3124
2537
749
1789
3588
4884
3453
189
3423
6208
1421
3116
6561
7
1490
6604
2635
7502
3867
4158
4756
2048
3633
3556
961
5722
1213
5896
5342
3579
5735
4785
7081
5586
321
3332
5706
1346
6503
6217
5384
5820
3666
3381
3660
1003
7064
6366
4857
6177
3321
668
1012
3759
6961
6525
1894
5646
294
231
4001
6028
5080
5303
4932
3417
6105
1867
4990
269
3013
6397
3875
4362
4740
3958
6773
973
5503
5425
6458
1422
4038
2849
4485
1125
7158
6538
2737
173
3072
7237
1837
866
4098
4069
1762
3357
7056
587
4385
1535
5142
3843
718
4394
5062
2335
6124
2609
870
3527
4242
1646
1863
2898
4899
3260
6677
5507
322
3175
6117
1074
190
6184
1192
5500
6936
3597
5755
655
2733
7416
5053
6074
4092
822
2111
1593
3409
675
6736
5965
4011
4049
7089
890
4737
2014
3908
6628
2952
188
7005
5672
4365
242
1506
3935
1617
2821
4473
3682
65
1053
2822
135
3450
3105
7068
7139
2482
50
4678
2174
1596
2534
1039
3100
798
613
4481
206
4344
1611
3673
1257
7022
1770
6071
2675
6765
6665
2053
2815
6647
2126
1443
2797
696
685
3991
1933
4682
7260
3828
5198
6952
2015
771
4240
6871
3138
5483
1711
3511
142
6480
6791
6999
2377
2627
4613
1450
6984
1893
3204
7119
815
3786
6309
5058
4347
251
215
6849
6717
5434
6097
3008
5049
3314
3390
6246
5671
256
5170
2928
390
999
1218
6409
7080
5238
6496
3927
6993
6865
6514
6030
5661
2759
2805
4328
1445
4084
6505
3183
1578
2493
2259
6910
833
3895
3037
4938
1898
7347
7472
3677
2605
4361
2088
4338
2690
2720
2816
2322
31
4058
6839
5432
5795
3802
5042
5642
6685
4633
3993
6987
1712
4746
1161
1034
7526
6607
365
521
3394
3690
3834
4359
5279
6207
7220
1558
4798
929
7146
3211
1342
1399
3944
5943
5485
4085
7488
4200
4306
6300
5250
2368
6806
4384
972
3930
4644
3229
7270
2412
6813
4072
909
6703
2961
1487
2890
5534
1319
3919
2750
4071
5734
6775
436
4438
471
2869
6373
1714
3480
1707
6963
6278
2900
3363
4045
3645
6605
2344
474
813
3865
3509
6470
2608
1075
5831
3741
567
2735
5354
563
4830
2886
754
2441
2051
2424
480
1434
6212
5265
6479
5453
5280
5313
1549
1703
3398
4204
1975
5024
5350
2654
3156
1337
4888
5312
3553
484
4415
2175
2754
3684
2773
5524
3135
1147
255
4588
1852
1628
4920
2868
6756
6363
2311
7092
3287
4426
1498
170
6705
6752
4445
4501
3601
3890
6933
7205
4713
4489
4634
6443
7291
1001
4846
5879
1185
594
33
4608
2340
5138
4674
5372
5175
2618
7217
5579
2118
6209
3575
4591
3205
0
773
5465
5187
4247
5412
5309
5496
2861
4773
4009
5355
3145
4765
1781
6793
6226
4726
2746
3688
2871
1776
7323
925
4107
786
3291
3448
3840
1209
102
4632
3559
6824
2469
968
2611
4121
4027
3525
2436
665
6411
2262
5676
1754
5528
5451
1505
6761
2907
7511
51
2711
2823
5832
1528
6081
6540
4136
1237
6789
3341
2668
4253
1203
460
1881
6763
4839
5643
6653
4389
7476
7315
5490
1118
5817
4474
2843
626
1293
205
2850
5867
5577
6213
6269
3970
4146
2405
2361
1912
3410
6532
2302
860
6803
2092
451
3968
7024
3519
5670
2326
3187
3372
1321
1597
4452
1962
5893
1491
608
2954
6944
4115
3486
6648
2372
3316
7463
39
2481
3730
262
4101
4943
2755
882
6776
846
4905
2319
114
966
6131
5038
1123
5987
934
1834
1957
6086
1113
2137
4443
5314
5742
2856
6676
5707
1808
434
6970
131
2542
2624
3122
2462
568
7054
4825
1520
97
3748
3926
4360
4828
4869
1261
7437
6082
2497
120
6476
2018
5675
716
2016
6261
6138
3803
3024
6276
1937
5329
1804
2186
4425
1996
108
6568
1472
5323
3082
1979
7007
1222
4102
625
467
601
5390
4915
5539
2305
493
2676
6339
4552
3817
914
5784
5143
985
6024
6844
3060
3303
1133
3091
1444
5343
3962
7143
609
7402
2557
7297
2962
6827
2569
4179
2982
6010
329
1368
3452
2050
1240
1507
1069
1591
5386
6383
4047
3985
4666
6577
2206
5164
6755
3470
4320
6524
6808
7307
6344
5919
3353
3799
1689
1683
4387
834
1709
5553
5148
3539
6465
2981
4964
1408
2817
2836
4804
7522
353
7413
4948
4735
2417
5645
5771
769
6048
3751
2826
6368
5946
4800
4855
7218
4733
3386
4551
2643
4815
905
5729
3963
28
855
4414
1501
1131
4684
2895
3820
1765
3142
4309
1312
475
989
630
5299
6797
237
6114
1922
784
3637
6901
4747
2464
776
4091
5199
2882
2916
1772
7538
2158
7201
1788
1427
3546
1930
3230
5904
7133
2303
7337
4318
291
4457
5569
7242
5075
559
1895
4602
650
402
1581
6923
6179
6260
90
5248
5173
44
4210
3195
6251
77
694
282
6395
111
4579
5849
5030
6634
1875
575
7107
5103
7262
5794
5294
241
7030
2553
4600
3995
2150
4772
4292
2577
3879
6836
5378
3587
664
2386
2573
2536
388
6555
1484
7063
4706
2552
1183
3029
1845
1330
2452
7372
243
6691
6498
5845
6315
1187
2459
488
1488
5035
735
1354
4754
4319
3638
121
348
3760
236
3584
6766
4195
3339
2725
3839
2625
6034
1824
4668
3244
4593
7407
5364
271
6456
27
4421
2085
928
1430
4235
1830
2645
5073
374
375
4727
6801
6270
6516
5359
3118
3906
7172
7130
6891
3050
4537
4573
4860
3543
4791
5172
3288
4453
2403
3656
5230
800
6336
7132
3858
3671
5327
7376
4616
153
4182
6042
7503
5934
2651
1349
1020
6774
4687
5358
2281
7549
5757
6873
3439
7351
2960
5002
3726
552
7302
3642
3475
6572
2520
6422
5365
5700
4913
2932
2476
5031
2753
6743
6953
6935
4264
2360
640
7429
2034
5759
362
4849
638
5852
2904
1318
1983
6698
4064
7041
5275
6343
1439
4398
310
1249
4886
1446
2037
4303
2177
2084
1114
1649
4044
6492
6687
3877
6742
4039
3014
840
2885
3387
1393
2292
1167
5319
7087
92
4972
5866
4629
7249
2001
308
371
1944
3861
6230
5414
6354
4099
1
4980
5437
3069
7273
1359
1687
2909
801
2948
2280
5222
210
2387
7002
5268
2837
6044
6468
4212
2333
2009
1282
6942
1310
1098
4563
6351
6907
4823
6425
1797
1862
4527
7004
3989
6068
576
4900
7319
2467
6851
2264
4251
3389
4138
4502
7278
1503
595
1224
3672
6879
3123
7020
1438
4965
5021
3222
7174
5180
5740
4332
6523
4087
2694
2671
2881
522
5976
2142
4331
725
1568
2338
6553
6098
6109
7165
6975
3293
661
3434
3892
5665
3382
1904
4511
1945
692
6642
1464
2518
2199
2245
3953
5516
4346
2516
7482
5599
1202
6268
598
1967
4532
2258
86
5245
1560
6120
5236
7211
2921
2949
66
7253
6657
129
3199
63
5756
5611
5318
931
6823
6299
2678
5458
4076
5846
1530
3663
4388
4162
3612
319
2430
3498
7518
1420
969
5701
4818
6442
3675
6548
3350
1748
7415
2159
3639
2989
3874
2433
6711
5196
2742
5224
1644
1723
4540
1052
2276
6495
3077
68
224
96
7397
6599
6145
3979
2588
410
5973
71
5356
6550
4488
506
7382
2617
1135
2888
5626
4222
5463
6554
2215
5888
2040
6623
49
6201
5557
616
1372
4140
3849
2600
6317
5587
6353
6876
3738
3264
5112
7352
2165
865
273
5830
259
4286
2180
3702
477
376
1021
6645
6619
4994
4701
5065
705
6969
2442
7104
1584
199
3640
787
6349
5447
2700
537
4495
2122
1009
6222
2375
5146
7193
3701
298
1836
2002
6948
4807
4161
4813
6449
7287
5782
3171
392
7268
5232
2760
4019
4803
4075
524
437
3302
5682
3629
5267
2251
5991
589
1820
4838
7418
6410
37
4283
1155
1495
6672
7145
7076
4056
7481
7390
6413
825
7085
6146
